espressif/esp_secure_cert_mgr/examples/esp_secure_cert_ota_example/sdkconfig.ci.unallocated_ota
# CI configuration for ESP32C3 QEMU pytest

# Enable QEMU target
CONFIG_IDF_TARGET="esp32c3"

# Enable Ethernet for QEMU
# QEMU-Related configurations
CONFIG_EXAMPLE_CONNECT_ETHERNET=y
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_ETHERNET_OPENETH_SUPPORT=y
CONFIG_ETHERNET_INTERNAL_SUPPORT=n
CONFIG_ETHERNET_SPI_SUPPORT=n

# Disable DS peripheral
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n

# Disable OTA URL FROM_STDIN (will be set via stdin in test)
CONFIG_EXAMPLE_FIRMWARE_UPGRADE_URL="FROM_STDIN"

# Enable OTA test mode
CONFIG_EXAMPLE_ESP_SECURE_CERT_OTA_TEST=y

# Use unallocated space mode for test
CONFIG_EXAMPLE_ESP_SECURE_CERT_OTA_USE_UNALLOCATED_SPACE=y

# Flash size for QEMU (2MB)
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"

# OTA timeout
CONFIG_EXAMPLE_OTA_RECV_TIMEOUT=30000

# Enable secure cert manager
CONFIG_ESP_SECURE_CERT_SUPPORT_LEGACY_FORMATS=n

# Enable OTA data partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
CONFIG_EXAMPLE_CONNECT_IPV6=n
